<?php

return [

    'animals_breeds'     => [
        'title'       => 'Породы животных',
        'create'      => 'Создание породы',
        'edit'        => 'Редактирование породы',
        'description' => 'Импортированные породы из ХОРРИОТ',
        'breed_id'    => 'ID породы',
        'breed_name'  => 'Наименование породы'
    ],
    'animals_species'    => [
        'title'       => 'Виды животных',
        'create'      => 'Создание вида',
        'edit'        => 'Редактирование вида',
        'description' => 'Импортированные виды животных из ХОРРИОТ',
        'specie_id'   => 'ID вида',
        'specie_name' => 'Наименование вида'
    ],
    'animals_genders'    => [
        'title'       => 'Полы животных',
        'create'      => 'Создание пола',
        'edit'        => 'Редактирование пола',
        'description' => 'Импортированные полы из ХОРРИОТ',
        'gender_id'   => 'ID пола',
        'gender_name' => 'Наименование пола'
    ],
    'tools_locations'    => [
        'title'              => 'Места нанесения маркировки',
        'create'             => 'Создание места нанесения',
        'edit'               => 'Редактирование места нанесения',
        'description'        => 'Импортированные места нанесения из ХОРРИОТ',
        'tool_location_id'   => 'ID места нанесения',
        'tool_location_name' => 'Наименование места нанесения'
    ],
    'keeping_purposes'   => [
        'title'                => 'Цели содержания',
        'create'               => 'Создание цели содержания',
        'edit'                 => 'Редактирование цели содержания',
        'description'          => 'Импортированные цели содержания из ХОРРИОТ',
        'keeping_purpose_id'   => 'ID цели содержания',
        'keeping_purpose_name' => 'Наименование цели содержания'
    ],
    'keeping_types'      => [
        'title'             => 'Типы содержания',
        'create'            => 'Создание типа содержания',
        'edit'              => 'Редактирование типа содержания',
        'description'       => 'Импортированные типы содержания из ХОРРИОТ',
        'keeping_type_id'   => 'ID типа содержания',
        'keeping_type_name' => 'Наименование типа содержания'
    ],
    'mark_statuses'      => [
        'title'            => 'Виды маркирования',
        'create'           => 'Создание вида маркирования',
        'edit'             => 'Редактирование вида маркирования',
        'description'      => 'Импортированные виды маркирования из ХОРРИОТ',
        'mark_status_id'   => 'ID вида маркирования',
        'mark_status_name' => 'Наименование вида маркирования'
    ],
    'mark_tool_types'    => [
        'title'               => 'Типы маркирования',
        'create'              => 'Создание типа маркирования',
        'edit'                => 'Редактирование типа маркирования',
        'description'         => 'Импортированные типы маркирования из ХОРРИОТ',
        'mark_tool_type_id'   => 'ID типа маркирования',
        'mark_tool_type_name' => 'Наименование типа маркирования'
    ],
    'mark_types'         => [
        'title'          => 'Виды номеров',
        'create'         => 'Создание вида номера',
        'edit'           => 'Редактирование вида номера',
        'description'    => 'Импортированные виды номеров из ХОРРИОТ',
        'mark_type_id'   => 'ID вида номера',
        'mark_type_name' => 'Наименование вида номера'
    ],
    'out_basises'        => [
        'title'          => 'Основания выбытия',
        'create'         => 'Создание основания выбытия',
        'edit'           => 'Редактирование основания выбытия',
        'description'    => 'Импортированные основания выбытия из ХОРРИОТ',
        'out_basis_id'   => 'ID основания выбытия',
        'out_basis_name' => 'Наименование основания выбытия'
    ],
    'out_types'          => [
        'title'         => 'Типы расхода',
        'create'        => 'Создание типа расхода',
        'edit'          => 'Редактирование типа расхода',
        'description'   => 'Импортированные типы расхода из ХОРРИОТ',
        'out_type_id'   => 'ID типа расхода',
        'out_type_name' => 'Наименование типа расхода'
    ],
    'guid_self'          => 'GUID СВР',
    'guid_horriot'       => 'GUID Хорриот',
    'value_horriot'      => 'Значение Хорриот',
    'uuid_horriot'       => 'UUID Хорриот',
    'selex_code'         => 'Код в SEALEX',
    'item_status'        => 'Статус записи',
    'item_status_delete' => 'Статус удаления записи',
    'created_at'         => 'Дата создания',
    'update_at'          => 'Дата обновления'
];
